src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.ОстатокТоваровНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ОборотТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СписокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>EnumRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПриходТовараТЧ</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.СписокТоваровИУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныОтПроизводителя/ЦеныОтПроизводителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныОтПроизводителя</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.СписокТоваровИУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПриходТовара/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьЦену(ТоварДокумента)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент ",Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор ",Объект.Договор);
	СтруктураОтбора.Вставить("Товар ", ТоварДокумента);
	РезультатОтбора = РегистрыСведений.ЦеныОтПроизводителя.Получить(СтруктураОтбора);
	Возврат РезультатОтбора.Цена;
КонецФункции


&НаКлиенте
Процедура ПриходТовараТоварПриИзменении(Элемент)
	СтрокаРасчета = Элементы.ПриходТовара.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Товар);
	ПриходТовараЦенаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ПриходТовараКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПриходТовара.ТекущиеДанные;
	СерверныеПроцедурыАвтоСумма.АвтоСумма(СтрокаТабличнойЧасти);
КонецПроцедуры   

&НаКлиенте
Процедура ПриходТовараЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПриходТовара.ТекущиеДанные;
	СерверныеПроцедурыАвтоСумма.АвтоСумма(СтрокаТабличнойЧасти);
КонецПроцедуры
